{
    "662471": {
        "article_title": "Музыка как код — опробовать концепцию можно прямо в браузере",
        "article_sub_title": "Блог компании Аудиомания",
        "article_author": "mirhifi",
        "article_date": "2022-04-23, 18:47:37",
        "article_desc": "Существует множество языков для музыкального программирования. О некоторых из них, например, Sporth или ORCA, мы рассказывали в блоге. Сегодня поговорим о проекте Harmonicon — браузерном DAW, реализующем концепцию music-as-code.",
        "article_url": "https://habr.com/ru/company/audiomania/blog/662471/"
    },
    "662572": {
        "article_title": "Маркетинг для сложных B2B-Продуктов",
        "article_sub_title": "Контекстная реклама",
        "article_author": "alexplaha",
        "article_date": "2022-04-23, 17:04:09",
        "article_desc": "Добрый день, если вы работаете в B2B-рынке, хотите продавать много и на большие чеки, в этой статье я расскажу, как их системно привлекать, где искать и почему с ними нельзя работать как с B2C.",
        "article_url": "https://habr.com/ru/post/662572/"
    },
    "662566": {
        "article_title": "Serializable vs. Snapshot Isolation Level",
        "article_sub_title": "Microsoft SQL Server *",
        "article_author": "mssqlhelp",
        "article_date": "2022-04-23, 15:20:12",
        "article_desc": "По материалам статьи Craig Freedman: Serializable vs. Snapshot Isolation LevelУровни изоляции транзакций Serializable и Snapshot обеспечивают согласованное чтение из базы данных. На любом из этих уровней изоляции транзакция может читать только зафиксированные данные. Более того, транзакция может читать одни и те же данные несколько раз, не заботясь о каких-либо параллельных транзакциях, вносящих изменения в эти же данные. Те нежелательные эффекты, которые были продемонстрированы в предыдущих статьях при Read Committed и Repeatable Read, на уровнях изоляции Serializable и Snapshot просто невозможны.",
        "article_url": "https://habr.com/ru/post/662566/"
    },
    "662557": {
        "article_title": "Почему IT-специалисты делают паузу в карьере и как после этого вернуться на работу",
        "article_sub_title": "Блог компании Нетология",
        "article_author": "Anastasia_rova",
        "article_date": "2022-04-23, 14:13:01",
        "article_desc": "Долгие перерывы в карьере обычно пугают работодателей. Поиски себя, увлечение новым делом, декретный отпуск вызывают вопросы у HR ещё до собеседования. Мы попробовали разобраться, почему айтишники делают перерывы в карьере, а также поговорили с HR-менеджерами и руководителями компаний, чтобы помочь кандидатам выработать правильную стратегию возвращения.",
        "article_url": "https://habr.com/ru/company/netologyru/blog/662557/"
    },
    "662561": {
        "article_title": "Задача про две ёмкости для жидкости",
        "article_sub_title": "Программирование *",
        "article_author": "aabzel",
        "article_date": "2022-04-23, 14:05:44",
        "article_desc": "Существует классическая задача:Есть 2 емкости: 5 литров и 3 литра. Как отмерить 4 литра жидкости используя только эти 2 емкости?В этом тексте я решу эту задачу в общем виде при помощи конечного автомата.  Также я упомяну про малоизвестный язык программирования Dot.",
        "article_url": "https://habr.com/ru/post/662561/"
    },
    "662559": {
        "article_title": "Как я разрабатывал игру fly bird 2",
        "article_sub_title": "*nix *",
        "article_author": "xverizex",
        "article_date": "2022-04-23, 13:57:49",
        "article_desc": "Это гифка, которую я сделал, чтобы показать вступление и как началась история путешествия птички. У меня есть друг, который не боится рисовать, даже если он не обучался рисованию профессионально. Я общаясь с ним как то вдохновился желанием рисовать и не бояться. В google play у меня есть старая игра, которую я делал на unity, когда только начинал работать с движком.https://play.google.com/store/apps/details?id=com.xverizex.fly_bird&hl=ru&gl=USДва комментария к старой игре дали мне желание сделать новую версию, но уже на C++ + SDL2 + OPENGL ES 3.2 + OPENSLES + glm. То есть я даже рад хотя бы двум комментариям о том что людям нравиться моё творчество, чтобы чувствовать себя прекрасно и продолжать делать игры.Так как у меня нормального опыта не было делать игры полноценные на sdl2, то я использовал разные виды кода, которые как я думал, что они правильные. Но поработав на работе и изучая код, я увидел что есть помимо того что я знаю (я про очереди сообщений), есть ещё mqueue. И только потом я додумался, что можно с помощью очередей сообщений отправлять из одного потока в другой что-нибудь. Вот пример как выглядела реализация.",
        "article_url": "https://habr.com/ru/post/662559/"
    },
    "662555": {
        "article_title": "Недружественные почтовые сервера",
        "article_sub_title": "Системное администрирование *",
        "article_author": "Player701",
        "article_date": "2022-04-23, 13:17:31",
        "article_desc": "Всем привет. Долго думал, о чём здесь написать — к сожалению, редко находится на это время и желание. Но недавно случилась одна не очень хорошая история, из которой я сделал выводы и решил, что эта информация может быть кому-то полезна, поэтому хочу рассказать о том, что произошло. История эта связана с электронной почтой, а если быть более точным — с отказом сетевой инфраструктуры РЖД в обслуживании персонального почтового сервера из-за его «недружественности».Я старался не углубляться сильно в технические моменты, так как посчитал, что для понимания ситуации они не очень важны. Но если кому-то будет интересно, могу попробовать рассказать более подробно о технической стороне вопроса в следующих публикациях.",
        "article_url": "https://habr.com/ru/post/662555/"
    },
    "662549": {
        "article_title": "Fiber изнутри: погружение в новый алгоритм согласования React",
        "article_sub_title": "ReactJS *",
        "article_author": "ssurrokk",
        "article_date": "2022-04-23, 12:29:40",
        "article_desc": "Погрузитесь глубоко в новую архитектуру React под названием Fiber и узнайте о двух основных фазах нового алгоритма согласования (reconciliation). Мы подробно рассмотрим, как React обновляет состояние и пропсы и обрабатывает дочерние элементы.",
        "article_url": "https://habr.com/ru/post/662549/"
    },
    "662551": {
        "article_title": "Что будет с ru-стартапами? Немного личной рефлексии, как русского YC-фаундера",
        "article_sub_title": "Венчурные инвестиции",
        "article_author": "grokru",
        "article_date": "2022-04-23, 12:15:30",
        "article_desc": "Сейчас полезно разделять два пласта информации и мотивации людей:1. Публичный (медийный) - мы все с лихвой его потребляем: новости, затрагивающие бизнес, выходят каждый день. В них желательно обращать внимание не на события, а на тренды. Например весь шум и ограничения банков ЕС - это пример вольной интерпретации одних и тех же писем европейского центробанка. Да, применяют их в разных странах очень по-разному. Или например стартап-программы ограничивают или ужесточают правила получения стартап-внж. Это объясняется небывалым наплывом аппликантов, раньше стартап-программы хантили стартапы, а сейчас завалены имейлами. Три с половиной сотрудника просто не могут справиться с этим потоком. Так что выводы типа “русским теперь вход заказан” просто несостоятельны, если смотреть на первопричины действий.Публично часто заявляются гуманистические и морально-этические мотивы, хотя мы все понимаем, что условный банк или инвестфонд, или госаппарат вряд ли хоть как-то руководствуются идеями гуманизма.Что касается стартапов, то все темы, которые максимально обильно обсуждаются публично, вроде сложности денежных переводов или релокации сотрудников/фаундеров - это просто мелкие неурядицы, с которыми уж кто-кто, а талантливые основатели точно справятся.2. Непубличный слой информации намного более важен и является источником цепочек действий, которые мы потом читаем в новостях и чатиках в очень упрощенной, примитивной и лозунгообразной форме. Я коснусь только одной темы - перспектив стартапов с русскоязычными корнями.",
        "article_url": "https://habr.com/ru/post/662551/"
    },
    "662513": {
        "article_title": "Аудиодайджест — материалы из «Мира Hi-Fi»: муз. сервисы для свободного творчества, технологии и подборки для чтения",
        "article_sub_title": "Блог компании Аудиомания",
        "article_author": "Audioman",
        "article_date": "2022-04-23, 11:29:30",
        "article_desc": "На выходных мы решили вновь поделиться избранными материалами из нашего «Мира Hi-Fi». Обсуждаем примечательные технологии, сервисы и аудиоконтент.",
        "article_url": "https://habr.com/ru/company/audiomania/blog/662513/"
    },
    "662543": {
        "article_title": "Релокация в Ташкент из Омска на машине — Дорога и приключения на таможне",
        "article_sub_title": "Habr",
        "article_author": "beneton2003",
        "article_date": "2022-04-23, 11:15:50",
        "article_desc": "Я задумывался о релокации наверное последние полтора-два года, но все никак не решался. В бизнесе было все классно, я работал в 3х направлениях, каждое из которых приносило свои дивиденды, а впереди рисовались еще более интересные перспективы. И если до 24 февраля в РФ было находиться все сложнее и сложнее, но еще теплились какие-то надежды на изменения, то 24го февраля все резко и окончательно изменилось, а уж после кадров с полей \"специальной военной операции\" находиться в РФ стало абсолютно невыносимо. Было принято решение пока не поздно незамедлительно покинуть территорию РФ. Всем кому интересен личный опыт переезда в Ташкент добро пожаловать под кат. Осторожно много букв и размышлений.",
        "article_url": "https://habr.com/ru/post/662543/"
    },
    "662541": {
        "article_title": "Щелчки в суставе",
        "article_sub_title": "Здоровье",
        "article_author": "Papinen",
        "article_date": "2022-04-23, 10:58:20",
        "article_desc": "В наше время различные патологии в височно-нижнечелюстном суставе (ВНЧС) встречаются все чаще и чаще, и то ли это связано с развитием социального общества, и как следствие повышенного стресса у людей, то ли раньше эти патологии просто меньше диагностировали из-за недостатка знаний, но факт остается фактом:  Практически каждый второй пациент на сегодняшний день имеет какие-либо признаки нарушения смыкания челюстей.",
        "article_url": "https://habr.com/ru/post/662541/"
    },
    "649365": {
        "article_title": "20 игр, чтобы видеть детали, чувствовать нюансы и уловить смысл дизайна",
        "article_sub_title": "Блог компании Timeweb Cloud",
        "article_author": "Asya_Dyu",
        "article_date": "Date 2022-04-23, Time 10:26:18",
        "article_desc": "No description",
        "article_url": "https://habr.com/ru/company/timeweb/blog/649365/"
    },
    "662463": {
        "article_title": "SimEarth: симулятор планеты, так и не ставший жанром",
        "article_sub_title": "Блог компании RUVDS.com",
        "article_author": "Erwinmal",
        "article_date": "Date 2022-04-23, Time 10:00:02",
        "article_desc": "No description",
        "article_url": "https://habr.com/ru/company/ruvds/blog/662463/"
    },
    "662594": {
        "article_title": "GraphQL &lt;-&gt; gRPC API Gateway на Java",
        "article_sub_title": "API *",
        "article_author": "Urgen",
        "article_date": "2022-04-24, 01:25:12",
        "article_desc": "В данной статье я хочу рассказать про процесс создания концепта API Gateway для обеспечения взаимодействия фронтенда, использующего GraphQL, и бэкенда, использующего gRPC, на Java с использованием фреймворка Quarkus.",
        "article_url": "https://habr.com/ru/post/662594/"
    },
    "662592": {
        "article_title": "Многопоточный энкодинг: переплатить вдвое или уйти на «встройку»?",
        "article_sub_title": "Блог компании HOSTKEY",
        "article_author": "rimecode",
        "article_date": "2022-04-24, 00:07:43",
        "article_desc": "Проведенный нами тест NVIDIA A4000 почти подтвердил, что она способна вытянуть на энкодинге до 16 независимых видеопотоков FullHD в формате H264. Удастся ли кратно увеличить производительность с профессиональной видеокартой, которая стоит в два раза дороже? Попробуем проверить.В нашей второй статье про энкодинг (с тестом А4000) мы упустили, что видеопоток бывает и большего разрешения, поэтому стоит протестировать энкодинг файлов в формате 4К. Для полноты картины мы также сравним энкодинг на решениях от NVIDIA со встроенным GPU от Intel. Некоторые профессионалы полагают, будто достаточно собрать тот же FFmpeg со включенным QuickSync и внешняя видеокарта станет не нужна. Проверим и это утверждение.",
        "article_url": "https://habr.com/ru/company/hostkey/blog/662592/"
    },
    "662586": {
        "article_title": "Нужен ли ALR-экран вашему UST-проектору. Обзор и тест",
        "article_sub_title": "Гаджеты",
        "article_author": "eldar_elf",
        "article_date": "2022-04-23, 21:26:23",
        "article_desc": "Два месяца назад, купив короткофокусный проектор, был абсолютно уверен, что ALR-экран мне не нужен и картинка на светло-серой стене и без него выглядит отлично. Я никогда так не ошибался в своей жизни (с)",
        "article_url": "https://habr.com/ru/post/662586/"
    },
    "662582": {
        "article_title": "Как настроиться на работу?",
        "article_sub_title": "GTD *",
        "article_author": "GenPol",
        "article_date": "2022-04-23, 20:19:07",
        "article_desc": "Бывает такое, что работать не хочется, а вот например поделать что-нибудь другое, у вас силы есть? Теперь давайте представим, что вы очень много отжимались и руки у вас теперь отваливаются. Поэтому поднимать вы уже ничего не сможете, а вот ходить запросто. Вот тоже самое может быть и с вашей головой, если какие-то мысли её сильно напрягают, она устаёт, и думает уже о совсем другом.",
        "article_url": "https://habr.com/ru/post/662582/"
    },
    "662596": {
        "article_title": "Друг или враг? Стоит ли бояться искусственного интеллекта?",
        "article_sub_title": "Будущее здесь",
        "article_author": "slusarenko",
        "article_date": "2022-04-24, 02:30:17",
        "article_desc": "Искусственный интеллект - это уже не сказка. Почему он уже превосходит человеческий мозг и какая правовая основа может защитить нас от неправомерных деяний с его стороны?",
        "article_url": "https://habr.com/ru/post/662596/"
    },
    "662580": {
        "article_title": "Настройка локальной синхронной репликации используя DRDB9",
        "article_sub_title": "Настройка Linux *",
        "article_author": "lignumq",
        "article_date": "2022-04-23, 19:50:36",
        "article_desc": "DRBD (Distributed Replicated Block Device — распределённое реплицируемое блочное устройство) представляет собой распределенное, гибкое и универсально реплицируемое решение хранения данных для Linux. DRBD имеет поверхностное сходство с RAID-1 в том, что он включает в себя копию данных на двух устройствах хранения, так что в случае сбоя данные на другом могут быть использованы. Однако оно работает совсем иначе, чем RAID и даже сетевой RAID.В этой статье я поделюсь опытом как создать репликацию drbd локально, не используя drbdadm, а используя drbdsetup и drbdmeta.",
        "article_url": "https://habr.com/ru/post/662580/"
    },
    "662576": {
        "article_title": "Очередные поиски флага на Hackthebox в категории OSINT",
        "article_sub_title": "Информационная безопасность *",
        "article_author": "Segrey646",
        "article_date": "2022-04-23, 19:10:47",
        "article_desc": "Привет, дорогой друг! Сегодня я продолжу рассказывать про поиск флага на Hackthebox. Забегу немного вперед: данная статья будет очень короткой. Мне довольно легко и быстро удалось найти флаг.Итак, само задание:Can you find something to help you break into the company 'Evil Corp LLC'. Recon social media sites to see if you can find any useful information.По-русски: нас просят найти в социальных сетях информацию, которая поможет проникнуть в компанию \"Evil Corp LLC\"Как и любой специалист, я очень ленив. Чтобы не ломать голову, я пошел в Google и написал там такой запрос:evil corp llc site instagram.comНе долго думая, кликнул на первую ссылку.",
        "article_url": "https://habr.com/ru/post/662576/"
    },
    "662600": {
        "article_title": "Влияние медитации на негативные симптомы шизофрении и побочки нейролептиков",
        "article_sub_title": "Мозг",
        "article_author": "marimero",
        "article_date": "2022-04-24, 04:29:44",
        "article_desc": "Симптомы шизофрении делятся на негативные, позитивные и когнитивные. С позитивными все просто, хоть они и наиболее красочны и в первую очередь бросаются в глаза простому человеку, но они легче всего подавляются нейролептиками и являются наиболее выражены только в момент психоза. С когнитивными, как  правило, ни то, ни се: с одной стороны они особо не причиняют страданий, крайне редко вызывают инвалидность, с другой стороны появляются исследования о применении препаратов off-label снижающих эти симптомы (хоть в аннотации препаратов и не стоит показание шизофрения). Дальше я постараюсь пояснить почему в основу статьи легли негативные.",
        "article_url": "https://habr.com/ru/post/662600/"
    },
    "662598": {
        "article_title": "Большая статья о переезде на остров Пенанг, Малайзия. Часть 1",
        "article_sub_title": "IT-эмиграция",
        "article_author": "samson28",
        "article_date": "2022-04-24, 04:10:38",
        "article_desc": "2019-й год я встретил, работая в отделе визуализации медицинских данных в медицинской госкомпании. На тот момент я имел небольшой опыт работы непосредственно разработчиком на C++ (около 1,5 лет) и заполненный на английском языке профиль в LinkedIn. Я придерживаюсь мнения, что нужно и стоит иметь опубликованное резюме и периодически проходить собеседования, чтобы быть в курсе, что происходит на рынке и что и как спрашивают на собеседованиях.Где-то с января 2019-го года я стал получать сообщения в LI с предложениями пообщаться. Было достаточно много сообщений от разных рекрутинговых и не только компаний, которые, как я понял, набивают периодически собственные базы и поэтому обзванивают людей. Но среди предложений были и достаточно интересные в локациях от Москвы и Финляндии до Германии и юга Франции. Правда, ни одно предложение не дошло на тот момент до предложения о работе.Жизнь продолжалась, работа тоже, надвигалось лето с длинным запланированным отпуском. За неделю до отпуска мне пришло сообщение с предложением о собеседовании от HR компании Люксофт. Времени перед отпуском не было, поэтому сообщение было злостно проигнорировано (спойлер: всегда отвечайте HR!, они хорошие!). Но перед самым отпуском жена говорит: «А чего это ты не ответил? Напиши им, что уезжаешь в отпуск и сможешь говорить после него». Так я и сделал, но в ответ мне сказали, что позиция достаточно срочная и если у меня вдруг есть возможность, то были бы рады пообщаться раньше. Ну хорошо, давайте. Договорились о первом собеседовании.",
        "article_url": "https://habr.com/ru/post/662598/"
    }
}
